drop table if exists "Груз", "Журнал", "Логистика", "Локомотив", "Маршрут", "Месторождение", "Предприятие", "Станция", "Хранилище", "Ячейка";
drop type if exists "Материал", "Тип станции", "Тип предприятия", "Цель прибытия";

create extension if not exists PostGIS;


--------------------------------------------------------------------------------
--  ТИПЫ ДАННЫХ  ---------------------------------------------------------------
--------------------------------------------------------------------------------


create type "Тип станции" as enum (
  'Депо',
  'АЗС',
  'Буферная стоянка',
  'Месторождение',
  'Предприятие',
  'Сортировочный пункт');
create type "Материал" as enum (
  'Уголь',
  'Железная руда',
  'Медная руда',
  'Сырая нефть',
  'Вода',
  'Железная плита',
  'Медная плита',
  'Железная шестерня',
  'Медный кабель',
  'Электросхема',
  'Стальная балка',
  'Радар',
  'Попутный нефтяной газ',
  'Пластмассовый брусок',
  'Сера',
  'Взрывчатка',
  'Разр. к-к. снаряд',
  'Артиллерийский снаряд');
create type "Тип предприятия" as enum (
  'Сборочный автомат',
  'Электрическая печь',
  'Нефтеперерабатывающий завод',
  'Химический завод');
create type "Цель прибытия" as enum (
  'Ожидание',
  'Заправка',
  'Полная погрузка',
  'Полная разгрузка',
  'Частичная погрузка',
  'Частичная разгрузка');


--------------------------------------------------------------------------------
--  ТАБЛИЦЫ  -------------------------------------------------------------------
--------------------------------------------------------------------------------


create table "Станция" (
  "Номер" integer primary key generated always as identity,
  "Имя" text not null,
  "Тип" "Тип станции" not null,
  "Ширина" integer not null check ("Ширина" >= 0), -- если равна нулю, значит нельзя подъехать (ведётся ремонт или ещё что-то такое)
  unique ("Имя", "Тип")
);

create table "Маршрут" (
  "Номер" integer primary key generated always as identity,
  "Имя" text not null unique
  -- "Тип" пассажирский, грузовой, военного назначения
  -- "Максимальное число транспортных средств" 10
);

create table "Локомотив" (
  "Номер" integer primary key generated always as identity,
  "Имя" text not null unique,
  "Осевая нагрузка" numeric not null check ("Осевая нагрузка" > 0), -- кН
  "Мощность" numeric not null check ("Мощность" > 0) -- кВт
);

create table "Ячейка" (
  "Номер" integer primary key generated always as identity,
  "Ресурс" "Материал" not null,
  "Количество" numeric not null check ("Количество" > 0)
);

create table "Логистика" (
  "Номер" integer primary key generated always as identity,
  "Маршрут" integer not null references "Маршрут" ("Номер"),
  "Порядок" integer not null check ("Порядок" > 0),
  "Станция" integer not null references "Станция" ("Номер"),
  "Цель" "Цель прибытия" not null,
  unique ("Маршрут", "Порядок")
);

create table "Месторождение" (
  "Номер" integer primary key references "Станция" ("Номер"),
  "Сырьё" "Материал" not null,
  "Количество" numeric not null check ("Количество" >= 0) -- тонны, м3
);

create table "Предприятие" (
  "Номер" integer primary key references "Станция" ("Номер"),
  "Тип" "Тип предприятия" not null,
  "Продукция" "Материал" not null,
  "Производительность" numeric not null check ("Производительность" >= 0.0)
);

create table "Хранилище" (
  "Номер" integer primary key generated always as identity,
  "Станция" integer not null references "Станция" ("Номер"),
  "Ячейка" integer not null unique references "Ячейка" ("Номер"),
  unique ("Станция", "Ячейка")
);

create table "Груз" (
  "Номер" integer primary key generated always as identity,
  "Локомотив" integer not null references "Локомотив" ("Номер"),
  "Ячейка" integer not null unique references "Ячейка" ("Номер")
);

create table "Журнал" (
  "Номер" integer primary key generated always as identity,
  "Время прибытия" timestamp not null,
  "Время отправления" timestamp, -- если null, то поезд находится на станции
  "Локомотив" integer not null references "Локомотив" ("Номер"),
  "Местоположение" integer not null references "Логистика" ("Номер"),
  check ("Время прибытия" <= "Время отправления" or "Время отправления" is null)
);


--------------------------------------------------------------------------------
--  ЗАПОЛНЕНИЕ  ----------------------------------------------------------------
--------------------------------------------------------------------------------


insert into "Станция" ("Имя", "Тип", "Ширина") values
('Уголь-1', 'Месторождение', 4),
('Уголь-1', 'АЗС', 8),
('Массив-1', 'Буферная стоянка', 40),
('Утилизатор', 'Депо', 200),
('Железо-1', 'Месторождение', 8),
('Медь-1', 'Месторождение', 4),
('Нефть-1', 'Месторождение', 2),
('Вода-1', 'Месторождение', 2),
('Вода-2', 'Месторождение', 2),
('Вода-3', 'Месторождение', 2),
('Вода-4', 'Месторождение', 2),
('Плавильня-1', 'Предприятие', 2),
('Плавильня-2', 'Предприятие', 2),
('Сборка-1', 'Предприятие', 2),
('Сборка-2', 'Предприятие', 2),
('Сборка-3', 'Предприятие', 2),
('Плавильня-3', 'Предприятие', 2),
('Сборка-4', 'Предприятие', 2),
('Нефть-1', 'Предприятие', 2),
('Химия-1', 'Предприятие', 2),
('Химия-2', 'Предприятие', 2),
('Химия-3', 'Предприятие', 2),
('Сборка-5', 'Предприятие', 2),
('Сборка-6', 'Предприятие', 2),
('Сортировка-1', 'Сортировочный пункт', 20), -- склады для сухого сырья
('Сортировка-2', 'Сортировочный пункт', 20), -- склады для аморфного сырья
('Сортировка-3', 'Сортировочный пункт', 20), -- склады для продуктов производства
('Сортировка-4', 'Сортировочный пункт', 20); -- военные склады

insert into "Месторождение" values
((select "Номер" from "Станция" where "Имя" = 'Уголь-1' and "Тип" = 'Месторождение'), 'Уголь', 500000),
((select "Номер" from "Станция" where "Имя" = 'Железо-1' and "Тип" = 'Месторождение'), 'Железная руда', 2500000),
((select "Номер" from "Станция" where "Имя" = 'Медь-1' and "Тип" = 'Месторождение'), 'Медная руда', 1700000),
((select "Номер" from "Станция" where "Имя" = 'Нефть-1' and "Тип" = 'Месторождение'), 'Сырая нефть', 4500000),
((select "Номер" from "Станция" where "Имя" = 'Вода-1' and "Тип" = 'Месторождение'), 'Вода', 420000000),
((select "Номер" from "Станция" where "Имя" = 'Вода-2' and "Тип" = 'Месторождение'), 'Вода', 733000000),
((select "Номер" from "Станция" where "Имя" = 'Вода-3' and "Тип" = 'Месторождение'), 'Вода', 123334400),
((select "Номер" from "Станция" where "Имя" = 'Вода-4' and "Тип" = 'Месторождение'), 'Вода',  20898800);

insert into "Предприятие" values
((select "Номер" from "Станция" where "Имя" = 'Плавильня-1' and "Тип" = 'Предприятие'), 'Электрическая печь', 'Железная плита', 65.0),
((select "Номер" from "Станция" where "Имя" = 'Плавильня-2' and "Тип" = 'Предприятие'), 'Электрическая печь', 'Медная плита', 7.5),
((select "Номер" from "Станция" where "Имя" = 'Сборка-1' and "Тип" = 'Предприятие'), 'Сборочный автомат', 'Железная шестерня', 5.0),
((select "Номер" from "Станция" where "Имя" = 'Сборка-2' and "Тип" = 'Предприятие'), 'Сборочный автомат', 'Медный кабель', 15.0),
((select "Номер" from "Станция" where "Имя" = 'Сборка-3' and "Тип" = 'Предприятие'), 'Сборочный автомат', 'Электросхема', 5.0),
((select "Номер" from "Станция" where "Имя" = 'Плавильня-3' and "Тип" = 'Предприятие'), 'Электрическая печь', 'Стальная балка', 8.0),
((select "Номер" from "Станция" where "Имя" = 'Сборка-4' and "Тип" = 'Предприятие'), 'Сборочный автомат', 'Радар', 1.0),
((select "Номер" from "Станция" where "Имя" = 'Нефть-1' and "Тип" = 'Предприятие'), 'Нефтеперерабатывающий завод', 'Попутный нефтяной газ', 200.0),
((select "Номер" from "Станция" where "Имя" = 'Химия-1' and "Тип" = 'Предприятие'), 'Химический завод', 'Пластмассовый брусок', 8.0),
((select "Номер" from "Станция" where "Имя" = 'Химия-2' and "Тип" = 'Предприятие'), 'Химический завод', 'Сера', 8.0),
((select "Номер" from "Станция" where "Имя" = 'Химия-3' and "Тип" = 'Предприятие'), 'Химический завод', 'Взрывчатка', 16.0),
((select "Номер" from "Станция" where "Имя" = 'Сборка-5' and "Тип" = 'Предприятие'), 'Сборочный автомат', 'Разр. к-к. снаряд', 4.0),
((select "Номер" from "Станция" where "Имя" = 'Сборка-6' and "Тип" = 'Предприятие'), 'Сборочный автомат', 'Артиллерийский снаряд', 4.0);

with "Новая ячейка" as (insert into "Ячейка" values (default, 'Уголь', 400) returning "Номер")
insert into "Хранилище" ("Станция", "Ячейка")
select "Станция"."Номер", "Новая ячейка"."Номер"
from "Станция", "Новая ячейка"
where "Станция"."Имя" = 'Уголь-1' and "Станция"."Тип" = 'Месторождение';

with "Новая ячейка" as (insert into "Ячейка" values (default, 'Уголь', 377700) returning "Номер")
insert into "Хранилище" ("Станция", "Ячейка")
select "Станция"."Номер", "Новая ячейка"."Номер"
from "Станция", "Новая ячейка"
where "Станция"."Имя" = 'Уголь-1' and "Станция"."Тип" = 'АЗС';

with "Новая ячейка" as (insert into "Ячейка" values (default, 'Железная руда', 670) returning "Номер")
insert into "Хранилище" ("Станция", "Ячейка")
select "Станция"."Номер", "Новая ячейка"."Номер"
from "Станция", "Новая ячейка"
where "Станция"."Имя" = 'Железо-1' and "Станция"."Тип" = 'Месторождение';

with "Новая ячейка" as (insert into "Ячейка" values (default, 'Медная руда', 670) returning "Номер")
insert into "Хранилище" ("Станция", "Ячейка")
select "Станция"."Номер", "Новая ячейка"."Номер"
from "Станция", "Новая ячейка"
where "Станция"."Имя" = 'Медь-1' and "Станция"."Тип" = 'Месторождение';

with "Новая ячейка" as (insert into "Ячейка" values (default, 'Сырая нефть', 510) returning "Номер")
insert into "Хранилище" ("Станция", "Ячейка")
select "Станция"."Номер", "Новая ячейка"."Номер"
from "Станция", "Новая ячейка"
where "Станция"."Имя" = 'Нефть-1' and "Станция"."Тип" = 'Месторождение';

with "Новая ячейка" as (insert into "Ячейка" values (default, 'Вода', 530) returning "Номер")
insert into "Хранилище" ("Станция", "Ячейка")
select "Станция"."Номер", "Новая ячейка"."Номер"
from "Станция", "Новая ячейка"
where "Станция"."Имя" = 'Вода-1' and "Станция"."Тип" = 'Месторождение';

-- сортировочный пункт для разнообразия
with "Новая ячейка" as (insert into "Ячейка" values (default, 'Уголь', 400) returning "Номер")
insert into "Хранилище" ("Станция", "Ячейка")
select "Станция"."Номер", "Новая ячейка"."Номер"
from "Станция", "Новая ячейка"
where "Станция"."Имя" = 'Сортировка-1' and "Станция"."Тип" = 'Сортировочный пункт';

with "Новая ячейка" as (insert into "Ячейка" values (default, 'Пластмассовый брусок', 700) returning "Номер")
insert into "Хранилище" ("Станция", "Ячейка")
select "Станция"."Номер", "Новая ячейка"."Номер"
from "Станция", "Новая ячейка"
where "Станция"."Имя" = 'Сортировка-1' and "Станция"."Тип" = 'Сортировочный пункт';

with "Новая ячейка" as (insert into "Ячейка" values (default, 'Стальная балка', 700) returning "Номер")
insert into "Хранилище" ("Станция", "Ячейка")
select "Станция"."Номер", "Новая ячейка"."Номер"
from "Станция", "Новая ячейка"
where "Станция"."Имя" = 'Сортировка-1' and "Станция"."Тип" = 'Сортировочный пункт';

insert into "Маршрут" ("Имя") values
('Обслуживание'),
('Железный круг'),
('Газовый круг'),
('Угольный круг'),
('Водяной круг'),
('Аморфный сырьевой круг'),
('Сухой сырьевой круг'),
('Детали-I'),
('Электросхема-I'),
('Детали-II'),
('Электросхема-II'),
('Сера-I'),
('Сера-II'),
('Радар-I'),
('Взрывчатка-I'),
('Взрывчатка-II'),
('РКС'),
('Артиллерия-I'),
('Артиллерия-II');

insert into "Логистика" ("Маршрут", "Порядок", "Станция", "Цель") values
((select "Номер" from "Маршрут" where "Имя" = 'Обслуживание'), 1, (select "Номер" from "Станция" where "Имя" = 'Утилизатор' and "Тип" = 'Депо'), 'Ожидание'),
((select "Номер" from "Маршрут" where "Имя" = 'Обслуживание'), 2, (select "Номер" from "Станция" where "Имя" = 'Уголь-1' and "Тип" = 'АЗС'), 'Заправка'),
((select "Номер" from "Маршрут" where "Имя" = 'Обслуживание'), 3, (select "Номер" from "Станция" where "Имя" = 'Массив-1' and "Тип" = 'Буферная стоянка'), 'Ожидание'),
((select "Номер" from "Маршрут" where "Имя" = 'Железный круг'), 1, (select "Номер" from "Станция" where "Имя" = 'Сортировка-1' and "Тип" = 'Сортировочный пункт'), 'Полная погрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Железный круг'), 2, (select "Номер" from "Станция" where "Имя" = 'Сборка-1' and "Тип" = 'Предприятие'), 'Частичная разгрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Железный круг'), 3, (select "Номер" from "Станция" where "Имя" = 'Сборка-3' and "Тип" = 'Предприятие'), 'Частичная разгрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Железный круг'), 4, (select "Номер" from "Станция" where "Имя" = 'Плавильня-3' and "Тип" = 'Предприятие'), 'Частичная разгрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Железный круг'), 5, (select "Номер" from "Станция" where "Имя" = 'Сборка-4' and "Тип" = 'Предприятие'), 'Полная разгрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Газовый круг'), 1, (select "Номер" from "Станция" where "Имя" = 'Сортировка-2' and "Тип" = 'Сортировочный пункт'), 'Полная погрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Газовый круг'), 2, (select "Номер" from "Станция" where "Имя" = 'Химия-1' and "Тип" = 'Предприятие'), 'Частичная разгрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Газовый круг'), 3, (select "Номер" from "Станция" where "Имя" = 'Химия-2' and "Тип" = 'Предприятие'), 'Полная разгрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Угольный круг'), 1, (select "Номер" from "Станция" where "Имя" = 'Сортировка-1' and "Тип" = 'Сортировочный пункт'), 'Полная погрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Угольный круг'), 2, (select "Номер" from "Станция" where "Имя" = 'Химия-1' and "Тип" = 'Предприятие'), 'Частичная разгрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Угольный круг'), 3, (select "Номер" from "Станция" where "Имя" = 'Химия-3' and "Тип" = 'Предприятие'), 'Полная разгрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Водяной круг'), 1, (select "Номер" from "Станция" where "Имя" = 'Сортировка-2' and "Тип" = 'Сортировочный пункт'), 'Полная погрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Водяной круг'), 2, (select "Номер" from "Станция" where "Имя" = 'Химия-2' and "Тип" = 'Предприятие'), 'Частичная разгрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Водяной круг'), 3, (select "Номер" from "Станция" where "Имя" = 'Химия-3' and "Тип" = 'Предприятие'), 'Полная разгрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Аморфный сырьевой круг'), 1, (select "Номер" from "Станция" where "Имя" = 'Вода-1' and "Тип" = 'Месторождение'), 'Частичная погрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Аморфный сырьевой круг'), 2, (select "Номер" from "Станция" where "Имя" = 'Нефть-1' and "Тип" = 'Месторождение'), 'Частичная погрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Аморфный сырьевой круг'), 3, (select "Номер" from "Станция" where "Имя" = 'Нефть-1' and "Тип" = 'Предприятие'), 'Полная погрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Аморфный сырьевой круг'), 4, (select "Номер" from "Станция" where "Имя" = 'Сортировка-2' and "Тип" = 'Сортировочный пункт'), 'Полная разгрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Сухой сырьевой круг'), 1, (select "Номер" from "Станция" where "Имя" = 'Железо-1' and "Тип" = 'Месторождение'), 'Частичная погрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Сухой сырьевой круг'), 2, (select "Номер" from "Станция" where "Имя" = 'Медь-1' and "Тип" = 'Месторождение'), 'Частичная погрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Сухой сырьевой круг'), 3, (select "Номер" from "Станция" where "Имя" = 'Уголь-1' and "Тип" = 'Месторождение'), 'Полная погрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Сухой сырьевой круг'), 4, (select "Номер" from "Станция" where "Имя" = 'Сортировка-1' and "Тип" = 'Сортировочный пункт'), 'Полная разгрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Детали-I'), 1, (select "Номер" from "Станция" where "Имя" = 'Сборка-1' and "Тип" = 'Предприятие'), 'Частичная погрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Детали-I'), 2, (select "Номер" from "Станция" where "Имя" = 'Сборка-2' and "Тип" = 'Предприятие'), 'Частичная погрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Детали-I'), 3, (select "Номер" from "Станция" where "Имя" = 'Плавильня-3' and "Тип" = 'Предприятие'), 'Частичная погрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Детали-I'), 4, (select "Номер" from "Станция" where "Имя" = 'Химия-1' and "Тип" = 'Предприятие'), 'Полная погрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Детали-I'), 5, (select "Номер" from "Станция" where "Имя" = 'Сортировка-3' and "Тип" = 'Сортировочный пункт'), 'Полная разгрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Электросхема-I'), 1, (select "Номер" from "Станция" where "Имя" = 'Сборка-3' and "Тип" = 'Предприятие'), 'Полная погрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Электросхема-I'), 2, (select "Номер" from "Станция" where "Имя" = 'Сортировка-3' and "Тип" = 'Сортировочный пункт'), 'Полная разгрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Детали-II'), 1, (select "Номер" from "Станция" where "Имя" = 'Сортировка-3' and "Тип" = 'Сортировочный пункт'), 'Полная погрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Детали-II'), 2, (select "Номер" from "Станция" where "Имя" = 'Сборка-3' and "Тип" = 'Предприятие'), 'Частичная разгрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Детали-II'), 3, (select "Номер" from "Станция" where "Имя" = 'Сборка-4' and "Тип" = 'Предприятие'), 'Частичная разгрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Детали-II'), 4, (select "Номер" from "Станция" where "Имя" = 'Сборка-5' and "Тип" = 'Предприятие'), 'Полная разгрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Электросхема-II'), 1, (select "Номер" from "Станция" where "Имя" = 'Сортировка-3' and "Тип" = 'Сортировочный пункт'), 'Полная погрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Электросхема-II'), 2, (select "Номер" from "Станция" where "Имя" = 'Сборка-4' and "Тип" = 'Предприятие'), 'Полная разгрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Сера-I'), 1, (select "Номер" from "Станция" where "Имя" = 'Химия-2' and "Тип" = 'Предприятие'), 'Полная погрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Сера-I'), 2, (select "Номер" from "Станция" where "Имя" = 'Сортировка-1' and "Тип" = 'Сортировочный пункт'), 'Полная разгрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Сера-II'), 2, (select "Номер" from "Станция" where "Имя" = 'Сортировка-1' and "Тип" = 'Сортировочный пункт'), 'Полная погрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Сера-II'), 1, (select "Номер" from "Станция" where "Имя" = 'Химия-3' and "Тип" = 'Предприятие'), 'Полная разгрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Радар-I'), 1, (select "Номер" from "Станция" where "Имя" = 'Сборка-4' and "Тип" = 'Предприятие'), 'Полная погрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Радар-I'), 2, (select "Номер" from "Станция" where "Имя" = 'Сортировка-4' and "Тип" = 'Сортировочный пункт'), 'Полная разгрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Взрывчатка-I'), 1, (select "Номер" from "Станция" where "Имя" = 'Химия-3' and "Тип" = 'Предприятие'), 'Полная погрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Взрывчатка-I'), 2, (select "Номер" from "Станция" where "Имя" = 'Сортировка-4' and "Тип" = 'Сортировочный пункт'), 'Полная разгрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Взрывчатка-II'), 1, (select "Номер" from "Станция" where "Имя" = 'Сортировка-4' and "Тип" = 'Сортировочный пункт'), 'Полная погрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Взрывчатка-II'), 2, (select "Номер" from "Станция" where "Имя" = 'Сборка-5' and "Тип" = 'Предприятие'), 'Полная разгрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'РКС'), 1, (select "Номер" from "Станция" where "Имя" = 'Сборка-5' and "Тип" = 'Предприятие'), 'Полная погрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'РКС'), 2, (select "Номер" from "Станция" where "Имя" = 'Сортировка-4' and "Тип" = 'Сортировочный пункт'), 'Полная разгрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Артиллерия-I'), 1, (select "Номер" from "Станция" where "Имя" = 'Сортировка-4' and "Тип" = 'Сортировочный пункт'), 'Полная погрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Артиллерия-I'), 2, (select "Номер" from "Станция" where "Имя" = 'Сборка-6' and "Тип" = 'Предприятие'), 'Полная разгрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Артиллерия-II'), 1, (select "Номер" from "Станция" where "Имя" = 'Сборка-6' and "Тип" = 'Предприятие'), 'Полная погрузка'),
((select "Номер" from "Маршрут" where "Имя" = 'Артиллерия-II'), 2, (select "Номер" from "Станция" where "Имя" = 'Сортировка-4' and "Тип" = 'Сортировочный пункт'), 'Полная разгрузка');

insert into "Локомотив" ("Имя", "Осевая нагрузка", "Мощность")
select 'ПВ-' || "Номер", 200 + cast(((random()-0.5) * 40) as integer), 6000 + cast((random() * 3000) as integer)
from "Маршрут";

insert into "Журнал" ("Время прибытия", "Время отправления", "Локомотив", "Местоположение")
select
  timestamp '2022-02-02 12:22:00' + make_interval(hours => cast((random() * 4) as integer), mins => cast((random() * 60) as integer)),
  case when random() > 0.8
  then null
  else timestamp '2022-02-02 16:23:00' + make_interval(hours => cast((random() * 6) as integer), mins => cast((random() * 60) as integer))
  end,
  "Локомотив"."Номер", (
-- чтобы random() выполнялся каждый раз, необходимо сделать подзапрос "коррелированным" (жёсткий костыль)
  select "Логистика"."Номер"+("Локомотив"."Номер"-"Локомотив"."Номер")
  from "Логистика"
  order by random()
  limit 1)
from "Локомотив"
order by random();

-- добавим в журнал простаивающий локомотив
insert into "Журнал" ("Время прибытия", "Время отправления", "Локомотив", "Местоположение")
values (
  timestamp '2022-02-02 11:01:01',
  null,
  cast(random() * (select count(*) from "Локомотив") as integer),
  (select "Номер" from "Логистика" where "Цель" = 'Ожидание' limit 1)
);

-- добавим в журнал простаивавший на этой неделе локомотив...
insert into "Журнал" ("Время прибытия", "Время отправления", "Локомотив", "Местоположение")
values (
  current_timestamp - interval '1 day',
  current_timestamp - interval '22 hour',
  3,
  (select "Номер" from "Логистика" where "Цель" = 'Ожидание' limit 1)
);

-- ...и передвинем его ещё куда-нибудь
insert into "Журнал" ("Время прибытия", "Время отправления", "Локомотив", "Местоположение")
values (
  current_timestamp - interval '4 hour', null, 3,
  (select "Номер" from "Логистика" order by random() limit 1)
);

with "Новая ячейка" as (insert into "Ячейка" values (default, 'Сырая нефть', 1000) returning "Номер")
insert into "Груз" ("Локомотив", "Ячейка")
select "Локомотив"."Номер", "Новая ячейка"."Номер"
from "Локомотив", "Новая ячейка"
where "Локомотив"."Имя" = 'ПВ-1';

with "Новая ячейка" as (insert into "Ячейка" values (default, 'Попутный нефтяной газ', 30000) returning "Номер")
insert into "Груз" ("Локомотив", "Ячейка")
select "Локомотив"."Номер", "Новая ячейка"."Номер"
from "Локомотив", "Новая ячейка"
where "Локомотив"."Имя" = 'ПВ-1';

with "Новая ячейка" as (insert into "Ячейка" values (default, 'Разр. к-к. снаряд', 100) returning "Номер")
insert into "Груз" ("Локомотив", "Ячейка")
select "Локомотив"."Номер", "Новая ячейка"."Номер"
from "Локомотив", "Новая ячейка"
where "Локомотив"."Имя" = 'ПВ-3';

with "Новая ячейка" as (insert into "Ячейка" values (default, 'Разр. к-к. снаряд', 100) returning "Номер")
insert into "Груз" ("Локомотив", "Ячейка")
select "Локомотив"."Номер", "Новая ячейка"."Номер"
from "Локомотив", "Новая ячейка"
where "Локомотив"."Имя" = 'ПВ-3';

with "Новая ячейка" as (insert into "Ячейка" values (default, 'Разр. к-к. снаряд', 100) returning "Номер")
insert into "Груз" ("Локомотив", "Ячейка")
select "Локомотив"."Номер", "Новая ячейка"."Номер"
from "Локомотив", "Новая ячейка"
where "Локомотив"."Имя" = 'ПВ-5';

with "Новая ячейка" as (insert into "Ячейка" values (default, 'Разр. к-к. снаряд', 100) returning "Номер")
insert into "Груз" ("Локомотив", "Ячейка")
select "Локомотив"."Номер", "Новая ячейка"."Номер"
from "Локомотив", "Новая ячейка"
where "Локомотив"."Имя" = 'ПВ-5';


--------------------------------------------------------------------------------
--  ЗАПРОСЫ ALTER TABLE  -------------------------------------------------------
--------------------------------------------------------------------------------


/* 1, 2. Добавить в таблицу "Станция" столбец "Местоположение" типа geometry(Point).
 * Сгенерировать случайное местоположение для всех станций.
 */
alter table "Станция"
add "Местоположение" geometry(Point); -- сначала nullable

update "Станция"
set "Местоположение" = ST_Point(random()*100000.0, random()*100000.0);

alter table "Станция"
alter "Местоположение" set not null; -- теперь not null


--------------------------------------------------------------------------------
--  ЗАПРОСЫ SELECT  ------------------------------------------------------------
--------------------------------------------------------------------------------


-- 1. Найти станции, через которые проходит больше всего маршрутов. Вывести имена.
with "Статистика" as (
  select "Станция", count("Станция") as "Кол-во маршрутов"
  from "Логистика"
  group by "Станция"
)
select "Имя", "Кол-во маршрутов"
from "Статистика"
join "Станция" on "Статистика"."Станция" = "Станция"."Номер"
where "Кол-во маршрутов" = (select max("Кол-во маршрутов") from "Статистика");


-- 2. Найти поезда, которые простаивают. Вывести имя.
/* Вытянуть из Журнала последние записи для каждого Локомотива; найти те, у которых статус "Ожидание".
 * Но можно проще: поезд простаивает, если ещё не отправился со станции со статусом "Ожидание".
 */
select "Локомотив"."Имя"
from "Журнал"
join "Логистика" on "Журнал"."Местоположение" = "Логистика"."Номер"
join "Локомотив" on "Журнал"."Локомотив" = "Локомотив"."Номер"
where "Цель" = 'Ожидание' and "Время отправления" is null;


-- 3. Найти непустые (в данный момент) поезда, находящиеся в работе больше недели. Вывести имя.
/* Поезда прекращают работу, как только переходят в статус "Ожидание", что может произойти по прибытию
 * на одну из станций техобслуживания, утилизации или стоянки.
 */
with "Ожидавшие" as (
  select distinct "Локомотив"."Номер"
  from "Журнал"
  join "Локомотив" on "Журнал"."Локомотив" = "Локомотив"."Номер"
  join "Логистика" on "Журнал"."Местоположение" = "Логистика"."Номер"
  where current_timestamp - "Время прибытия" <= interval '1 week'
    and "Логистика"."Цель" = 'Ожидание'
), "Гружёные" as (
  select distinct "Локомотив"
  from "Груз"
)
select "Локомотив"."Имя"
from "Локомотив"
where "Локомотив"."Номер" in (select * from "Гружёные")
  and "Локомотив"."Номер" not in (select * from "Ожидавшие");


-- 4. Для каждого поезда найти его общий пробег с момента начала ведения журнала. Вывести имя и пробег.
/* Считать, что поезд проезжает расстояние от одной станции до другой по прямой. */
with "Статистика" as (
  select "Локомотив"."Имя",
    ST_Distance(
      "Станция"."Местоположение",
      lag("Станция"."Местоположение", 1, "Станция"."Местоположение")
        over (partition by "Журнал"."Локомотив" order by "Время прибытия")
    ) as "Расстояние"
  from "Журнал"
  join "Логистика" on "Журнал"."Местоположение" = "Логистика"."Номер"
  join "Станция" on "Логистика"."Станция" = "Станция"."Номер"
  join "Локомотив" on "Журнал"."Локомотив" = "Локомотив"."Номер"
)
select "Статистика"."Имя", sum("Статистика"."Расстояние") as "Пробег"
from "Статистика"
group by "Статистика"."Имя";


-- 5. Для каждого предприятия найти ближайшее к нему озеро. Вывести имя предприятия, имя приозёрной станции и расстояние до неё.
with "Ближайшие" as (
  select
    "Станция"."Номер" as "Номер станции",
    "Станция"."Имя" as "Станция",
    "Станция"."Местоположение",
    min(ST_Distance("Станция"."Местоположение", "Озеро"."Местоположение")) as "Расстояние"
  from "Станция"
  cross join (
    select "Станция"."Имя", "Станция"."Местоположение"
    from "Станция"
    join "Месторождение" on
      "Станция"."Номер" = "Месторождение"."Номер"
      and "Месторождение"."Сырьё" = 'Вода') as "Озеро"
  where "Станция"."Тип" = 'Предприятие'
  group by "Станция"."Номер", "Станция"."Имя"
)
select "Ближайшие"."Станция", "Станция"."Имя" as "Озеро", "Ближайшие"."Расстояние"
from "Ближайшие"
join "Станция" on ST_Distance("Станция"."Местоположение", "Ближайшие"."Местоположение") = "Ближайшие"."Расстояние";


-- 6. Найти станции с наибольшим разнообразием грузов в хранилищах
with "Грузы" as (
  select
    "Станция"."Имя",
    count(distinct "Ячейка"."Ресурс") as "Разных"
  from "Хранилище"
  join "Станция" on "Хранилище"."Станция" = "Станция"."Номер"
  join "Ячейка" on "Хранилище"."Ячейка" = "Ячейка"."Номер"
  group by "Станция"."Имя"
)
select *
from "Грузы"
where "Разных" = (select max("Разных") from "Грузы");


--------------------------------------------------------------------------------
--  ТРИГГЕРЫ  ------------------------------------------------------------------
--------------------------------------------------------------------------------


-- 1. Проверка числа поездов на станции перед вставкой в журнал.
create or replace function "Проверить число поездов"()
returns trigger as $$
declare
  "Текущее количество" integer;
  "Вместимость" integer;
  "Номер станции" integer;
begin
  select "Станция" into "Номер станции"
  from "Логистика"
  where "Номер" = new."Местоположение";

  select count(*) into "Текущее количество"
  from "Журнал"
  join "Логистика" on "Журнал"."Местоположение" = "Логистика"."Номер"
  where "Логистика"."Станция" = "Номер станции"
    and "Журнал"."Время отправления" is null;

  select "Ширина" into "Вместимость"
  from "Станция"
  where "Номер" = "Номер станции";

  if "Текущее количество" >= "Вместимость" then
    raise exception 'Станция % уже заполнена (текущее количество поездов: %, вместимость: %)',
      "Номер станции", "Текущее количество", "Вместимость";
  end if;

  return new;
end;
$$ language plpgsql;

create trigger "Проверка числа поездов"
before insert on "Журнал"
for each row
execute function "Проверить число поездов"();

-- попробуем заставить триггер ругаться
insert into "Журнал" ("Время прибытия", "Время отправления", "Локомотив", "Местоположение")
values (
  timestamp '2022-02-02 11:01:01',
  null,
  2,
  24 /* лимит - 4 поезда */
);

